{
    "words": [
        {
            "word": "Galaxy",
            "definition": "A system of stars, dust, and gas held together by gravitational forces."
        },
        {
            "word": "Astronomy",
            "definition": "The scientific study of celestial objects, such as stars, planets, and galaxies."
        },
        {
            "word": "Black hole",
            "definition": "A region in space with extremely strong gravitational forces that nothing, not even light, can escape from."
        },
        {
            "word": "Satellite",
            "definition": "An object that orbits around a planet, moon, or other celestial body, often used for communication or scientific research."
        },
        {
            "word": "Asteroid",
            "definition": "A rocky object that orbits the Sun, usually found in the asteroid belt between Mars and Jupiter."
        },
        {
            "word": "Celestial",
            "definition": "Relating to the sky or outer space."
        },
        {
            "word": "Comet",
            "definition": "A celestial object made of ice, dust, and gas that develops a glowing coma and tail when it approaches the Sun."
        },
        {
            "word": "Cosmic",
            "definition": "Relating to the universe or outer space on a vast scale."
        },
        {
            "word": "Crater",
            "definition": "A large bowl-shaped depression on the surface of a planet, moon, or asteroid, typically caused by an impact of a meteoroid or asteroid."
        },
        {
            "word": "Dark matter",
            "definition": "A hypothetical form of matter that does not emit, absorb, or reflect light but is inferred to exist due to its gravitational effects on visible matter."
        },
        {
            "word": "Earth",
            "definition": "The third planet from the Sun, the only known celestial body to support life."
        },
        {
            "word": "Exoplanet",
            "definition": "A planet that orbits a star outside of our solar system."
        },
        {
            "word": "Gravity",
            "definition": "The force that attracts objects with mass towards each other."
        },
        {
            "word": "Interstellar",
            "definition": "Relating to the space between stars."
        },
        {
            "word": "Jupiter",
            "definition": "The largest planet in our solar system, known for its giant storm called the Great Red Spot."
        },
        {
            "word": "Lunar",
            "definition": "Relating to the Moon."
        },
        {
            "word": "Mars",
            "definition": "The fourth planet from the Sun, often called the 'Red Planet' due to its reddish appearance."
        },
        {
            "word": "Meteor",
            "definition": "A small rocky or metallic object that enters the Earth's atmosphere and burns up, producing a streak of light."
        },
        {
            "word": "Milky Way",
            "definition": "The galaxy in which our solar system is located."
        },
        {
            "word": "Moon",
            "definition": "A natural satellite that orbits around a planet, such as Earth's Moon."
        },
        {
            "word": "NASA",
            "definition": "The National Aeronautics and Space Administration, the United States' space agency."
        },
        {
            "word": "Nebula",
            "definition": "A cloud of gas and dust in space, often the birthplace of new stars."
        },
        {
            "word": "Neptune",
            "definition": "The eighth and farthest known planet from the Sun in our solar system."
        },
        {
            "word": "Orbit",
            "definition": "The path followed by an object, such as a planet or satellite, as it revolves around another object due to gravitational forces."
        },
        {
            "word": "Planet",
            "definition": "A celestial body that orbits a star, is spherical in shape, and has cleared its orbit of other debris."
        },
        {
            "word": "Rocket",
            "definition": "A vehicle that obtains thrust by expelling gases out of its rear, used for space exploration and launching satellites into orbit."
        },
        {
            "word": "Saturn",
            "definition": "The sixth planet from the Sun, known for its rings made of ice and dust particles."
        },
        {
            "word": "Solar system",
            "definition": "A system consisting of a star (such as the Sun) and the planets, moons, asteroids, and comets that orbit around it."
        },
        {
            "word": "Spacecraft",
            "definition": "A vehicle designed for travel or operation in outer space."
        },
        {
            "word": "Star",
            "definition": "A luminous celestial object consisting of a mass of gas held together by its own gravity, producing light and heat."
        }
    ]
}
